app/Models/AnggotaModel.php

SELECT *
FROM `anggota`
SELECT *
FROM `anggota`
WHERE `slug` = 'ahdar-karawita'
 LIMIT 1
---
    public function getAnggota($slug = false)
    {
        if($slug == false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();